updated documentation
swapped mermaid for plantuml diagrams
updated the pdf files
